Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/cost_of_the_case.html.txt.tmx
Source language: en
Languages: ga

source: Legal fees and costs for civil cases
ga: Táillí dlí agus costais ar chásanna sibhialta

source: If you are taking a civil case to court in Ireland, as soon as possible after you have given instructions to your solicitor, he/she must advise you in writing of the fees you will be charged for his/her services
ga: Má tá cás sibhialta á ghlacadh agat a fhad leis an gcúirt in Éirinn, chomh luath agus is féidir leat tar éis duit treoracha a thabhairt do d’aturnae, ní mór dó/di scéal a chur chugat i scríbhinn maidir leis na táillí a ghearrfar ort as a c(h)uid seirbhísí

source: If it is not possible to give you a definite sum, he/she must estimate a sum or at the very least describe the basis upon which charges or fees will be calculated
ga: Murar féidir suim chruinn a thabhairt duit, ní mór dó/di meastachán a thabhairt ar shuim nó, ar a laghad, cur síos a dhéanamh ar conas a ríomhfar muirir nó táillí

source: Usually solicitors will wait until a case is concluded before requiring payment of their fees
ga: Go hiondúil, fanann aturnaetha go dtí go gcuirtear cás i gcrích sula lorgaíonn siad íocaíocht a dtáillí

source: However, sometimes fees will be requested in advance, especially in a case where you run a high risk of losing
ga: Ach, anois agus arís, d’fhéadfadh sé go mbeadh éileamh déanta roimh ré ar na táillí, go háirithe má tá seans maith ann nach n-éireoidh leat sa chás

source: The solicitor's fee can consist of the professional fee, miscellaneous charges (for example, phone calls) and charges from third parties, (for example, government agencies).Solicitors are not allowed to charge you on the basis of a percentage of any award or settlement of your case
ga: Is éard a d’fhéadfadh bheith i gceist le táille an aturnae – an táille ghairmiúil, muirir ilghnéitheacha (mar shampla, glaonna gutháin) agus muirir ó thríú páirtithe, (mar shampla, gníomhaireachtaí rialtais). Ní cheadaítear d’aturnaetha táille a ghearradh ort ar bhonn céatadáin d’aon dámhachtain nó réiteach a dhéantar ar do chás

source: Solicitor's charges are based on the following:
ga: Bunaítear muirir aturnae ar an méid a leanas:

source: • the difficulty of the questions raised
ga: • deacracht na gceisteanna a chuirtear

source: • the skill, labour, specialised knowledge and responsibility involved
ga: • an scil, saothar, eolas speisialaithe agus an fhreagracht atá i gceist

source: • the number and importance of documents prepared or examined
ga: • líon agus tábhacht na gcáipéisí arna réiteach nó scrúdú

source: • the amount or value of any transaction involved
ga: • méid nó luach aon idirbhirt atá i gceist

source: • the importance of the matter to you
ga: • tábhacht an ábhair i do leith

source: • the time reasonably spent by personnel in the solicitor's firm on the matter
ga: • an t-am a chaith an pearsanra go réasúnta i ngnóthas an aturnae leis an ábhar

source: • the place or places and the circumstances in which the matter is pursued
ga: • an áit nó na háiteanna agus na cúinsí ina dtugtar faoin ábhar

source: If you are unhappy with your solicitor's bill you have a number of options, see 'Further Information' below
ga: Mura bhfuil tú sásta le bille d’aturnae, tá roinnt roghanna agat, féach, ‘Tuilleadh Faisnéise’ thíos

source: Usually if you win your case, most or all of your costs (including legal fees) will be paid for by the other party
ga: De ghnáth, má éiríonn leat i do chás, íocfaidh an páirtí an chuid is mó de do chostais (lena n-áirítear táillí dlí) nó iad go léir

source: However, you may be obliged to pay all the costs and fees of your own legal team and that of the other party in the following situations:
ga: D’fhéadfá bheith faoi dhualgas costais agus táillí uile d’fhoirne féin dlí agus iad siúd den pháirtí eile a íoc, áfach, sna cásanna a leanas:

source: • if you lose your case
ga: • mura n-éiríonn leat i do chás

source: • agree to accept an amount less than your full claim
ga: • má chomhaontaíonn tú chun glacadh le suim atá níos lú ná d’éileamh iomlán

source: • a court fails to award you your costs or a proportion of them
ga: • má theipeann ar chúirt do chostais nó comhréir díobh a dhámhachtain ort

source: • the court awards costs against you
ga: • déanann an chúirt na costais a dhámhachtain i do leith

source: It is important to note that InjuriesBoard.ie doesn't award costs for or against either party
ga: Is tábhachtach a thabhairt faoi deara nach mbronnann InjuriesBoard costais do cheachtar páirtí nó i leith ceachtar páirtí

source: A solicitor's fee must not be excessive for the work done
ga: Níor cheart do tháille aturnae bheith iomarcach don obair a rinneadh

source: If you think your solicitor's bill is excessive you should contact your solicitor to seek clarification and try to come to an agreement
ga: Má mheasann tú go bhfuil bille d’aturnae iomarcach, ba cheart duit teagmháil a dhéanamh le d’aturnae le soiléiriú a lorg agus le hiarracht a dhéanamh comhaontú a dhéanamh

source: Information on fees is available in the Law Society's Information in relation to legal charges (pdf) leaflet
ga: Tá fáil ar fhaisnéis ar tháillí i mbileog an Dlí-Chumainn Faisnéis maidir le muirir dhlí (pdf)

source: If you are still not happy you can make a complaint to the Law Society
ga: Mura bhfuil tú sásta go fóill, féadfaidh tú gearán a dhéanamh leis an Dlí-Chumann

source: As the regulatory body for solicitors in Ireland, the Law Society sets down rules and regulations about how solicitors may conduct their business, including legal charges
ga: Feidhmíonn an Dlí-Chumann mar an gcomhlacht rialála d’aturnaetha in Éirinn, agus leagann siad rialacha agus rialacháin síos faoi conas is féidir le haturnaetha tabhairt faoina gcuid gnó, lena n-áirítear muirir dhlí

source: There is a Disciplinary Tribunal, which can investigate any allegations of misconduct made against a solicitor
ga: Tá Binse Disciplíneach ann, ar féidir leis imscrúdú a dhéanamh ar aon líomhaintí de mhí-iompar a dhéantar i leith aturnae

source: Read more about making a complaint about a solicitor in Ireland here
ga: Is féidir leat tuilleadh a léamh faoi ghearán a dhéanamh faoi aturnae in Éirinn anseo

source: You could also have your legal costs independently and impartially assessed by the Taxing Master, this is called the taxation of costs
ga: Anuas air sin, d’fhéadfadh an Máistir Fómhais measúnú neamhchlaonta a dhéanamh ar do chostais dlí, tugtar cánachas costas air seo

source: The Taxing Master is an office of the High Court and has nothing to do with taxes or the Revenue Commissioners
ga: Oifig den Ard-Chúirt is ea an Máistir Fómhais agus ní bhaineann sé le cáin nó leis na Coimisinéirí Ioncaim

source: The Courts Service has information on the taxation of costs on its website
ga: Tá eolas ar chánachas costas ar láithreán gréasáin na Seirbhíse Cúirteanna

source: The Law Society also maintains a list of registered solicitors throughout the country
ga: Sa bhreis air sin, coimeádann an Dlí-Chumann liosta de na haturnaetha atá cláraithe ar fud na tíre

source: Search the directory of solicitor firms throughout Ireland here
ga: Cuardaigh an t-eolaire de ghnóthais aturnaetha ar fud na hÉireann anseo
